spec/fixtures/responses/status_success_ideal_paid.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <extendedStatusResponse xmlns="http://www.docdatapayments.com/services/paymentservice/1_3/" ddpXsdVersion="1.3.5">
            <statusSuccess>
                <success code="SUCCESS">Operation successful.</success>
                <report>
                    <approximateTotals exchangedTo="EUR" exchangeRateDate="2017-05-09 10:49:01">
                        <totalRegistered>100</totalRegistered>
                        <totalShopperPending>0</totalShopperPending>
                        <totalAcquirerPending>0</totalAcquirerPending>
                        <totalAcquirerApproved>100</totalAcquirerApproved>
                        <totalCaptured>100</totalCaptured>
                        <totalRefunded>0</totalRefunded>
                        <totalChargedback>0</totalChargedback>
                        <totalReversed>0</totalReversed>
                    </approximateTotals>
                    <payment>
                        <id>12345678</id>
                        <paymentMethod>IDEAL</paymentMethod>
                        <authorization>
                            <status>AUTHORIZED</status>
                            <amount currency="EUR">100</amount>
                            <confidenceLevel>ACQUIRER_APPROVED</confidenceLevel>
                            <capture>
                                <status>CAPTURED</status>
                                <amount currency="EUR">100</amount>
                            </capture>
                        </authorization>
                        <extended>
                            <riskChecks score="0"/>
                            <iDealPaymentInfo>
                                <issuerId>ING</issuerId>
                                <holderName>Onderheuvel</holderName>
                                <shopperBankAccount>
                                    <iban>NL44RABO0123456789</iban>
                                    <bic>RABONL2U</bic>
                                </shopperBankAccount>
                            </iDealPaymentInfo>
                        </extended>
                    </payment>
                    <consideredSafe>
                        <value>true</value>
                        <level>SAFE</level>
                        <date>2017-04-12T17:14:45.623+02:00</date>
                        <reason>EXACT_MATCH</reason>
                    </consideredSafe>
                </report>
            </statusSuccess>
        </extendedStatusResponse>
    </S:Body>
</S:Envelope>
