spec/fixtures/responses/status_success_without_payment.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <extendedStatusResponse xmlns="http://www.docdatapayments.com/services/paymentservice/1_3/" ddpXsdVersion="1.3.5">
            <statusSuccess>
                <success code="SUCCESS">Operation successful.</success>
                <report>
                    <approximateTotals exchangedTo="EUR" exchangeRateDate="2017-05-09 11:31:06">
                        <totalRegistered>100</totalRegistered>
                        <totalShopperPending>0</totalShopperPending>
                        <totalAcquirerPending>0</totalAcquirerPending>
                        <totalAcquirerApproved>0</totalAcquirerApproved>
                        <totalCaptured>0</totalCaptured>
                        <totalRefunded>0</totalRefunded>
                        <totalChargedback>0</totalChargedback>
                        <totalReversed>0</totalReversed>
                    </approximateTotals>
                    <consideredSafe>
                        <value>false</value>
                        <level>SAFE</level>
                    </consideredSafe>
                </report>
            </statusSuccess>
        </extendedStatusResponse>
    </S:Body>
</S:Envelope>